{
 "cells": [
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "\"\"\"\n",
    "1.3. Определение объёма эмпирического материала: Конспект + Код\n",
    "Суть раздела (Теория для аналитика)\n",
    "Автор решает классическую для любого исследователя задачу: как определить, \n",
    "сколько уголовных дел нужно изучить, \n",
    "чтобы выводы были достоверными и их можно было распространить на все подобные преступления?\n",
    "\n",
    "В терминах статистики:\n",
    "Генеральная совокупность (N) - это все-все преступления определённого вида \n",
    "(например, все кражи, совершённые в России за 5 лет). \n",
    "Изучить их идеально, но часто невозможно (дорого, долго, нет доступа).\n",
    "\n",
    "Выборочная совокупность (n) - это та часть дел, которую мы реально изучим.\n",
    "\n",
    "Репрезентативность — свойство выборки верно отражать свойства генеральной совокупности. \n",
    "Чтобы его достичь, нужно правильно рассчитать объём выборки и способ отбора.\n",
    "\n",
    "Главная мысль: Мы не можем изучать всё, но мы можем математически гарантировать, \n",
    "что ошибка от изучения части будет в допустимых пределах. \n",
    "Для этого используется формула расчёта объёма выборки.\n",
    "\n",
    "\"\"\""
   ],
   "id": "415752bd36d075df"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "\"\"\"МЕТОД 1 - ДИСПЕРСИЯ ПРИЗНАКА (Если есть количественный признак: ВОЗРАСТ, СРОК)\n",
    "Расчет объема пилотной выборки преступлений определенного типа \"УБИЙСТВО\" \n",
    "\n",
    "? СКОЛЬКО НАМ НАДО ИЗУЧИТЬ ДЕЛ, чтобы с уверенностью n% утверждать возраст преступника\"\"\""
   ],
   "id": "c0dd949c008747a6"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-02T20:47:33.302492Z",
     "start_time": "2026-03-02T20:47:31.980492Z"
    }
   },
   "cell_type": "code",
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "from scipy import stats\n",
    "\n",
    "# --- Шаг 1. Входные данные ---\n",
    "# Данные пилотного исследования (возраст из 25 дел)\n",
    "pilot_ages = [22, 25, 27, 31, 34, 34, 36, 38, 39, 41, 42, 43, 45, 46, 47, 48, 49, 51, 53, 55, 38, 29, 33, 44, 52]\n",
    "\n",
    "# Параметры исследования\n",
    "N = 245              # генеральная совокупность (из crimestat.ru)\n",
    "alpha = 0.05         # уровень значимости (95% доверительная вероятность)\n",
    "delta = 1            # предельная ошибка (в годах)\n",
    "\n",
    "# --- Шаг 2. Расчёт дисперсии по пилотной выборке ---\n",
    "pilot_series = pd.Series(pilot_ages)\n",
    "variance = pilot_series.var()\n",
    "std_dev = pilot_series.std()\n",
    "\n",
    "print(f\"Пилотная выборка: n = {len(pilot_ages)} дел\")\n",
    "print(f\"Средний возраст: {pilot_series.mean():.1f} лет\")\n",
    "print(f\"Дисперсия (σ²) = {variance:.2f}\")\n",
    "print(f\"Стандартное отклонение (σ) = {std_dev:.2f} лет\")\n",
    "\n",
    "# --- Шаг 3. Расчёт критерия Стьюдента ---\n",
    "# Для двустороннего интервала используем 1 - alpha/2\n",
    "t_value = stats.t.ppf(1 - alpha/2, df=N-1)\n",
    "print(f\"Критерий Стьюдента (t) = {t_value:.3f}\")\n",
    "\n",
    "# --- Шаг 4. Расчёт объёма выборки ---\n",
    "# Формула для бесповторного отбора\n",
    "numerator = (t_value**2) * variance * N\n",
    "denominator = (delta**2) * N + (t_value**2) * variance\n",
    "sample_size = numerator / denominator\n",
    "\n",
    "# Округляем вверх\n",
    "sample_size = int(np.ceil(sample_size))\n",
    "sample_percent = (sample_size / N) * 100\n",
    "\n",
    "print(f\"\\nРЕЗУЛЬТАТ:\")\n",
    "print(f\"Рекомендуемый объём выборки: {sample_size} уголовных дел\")\n",
    "print(f\"Это {sample_percent:.1f}% от генеральной совокупности (N={N})\")\n",
    "print(f\"С такой выборкой средний возраст будет определён с точностью ±{delta} год(а) с вероятностью {1-alpha:.0%}\")"
   ],
   "id": "f5f8b2ad527c05f4",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Пилотная выборка: n = 25 дел\n",
      "Средний возраст: 40.1 лет\n",
      "Дисперсия (σ²) = 83.74\n",
      "Стандартное отклонение (σ) = 9.15 лет\n",
      "Критерий Стьюдента (t) = 1.970\n",
      "\n",
      "РЕЗУЛЬТАТ:\n",
      "Рекомендуемый объём выборки: 140 уголовных дел\n",
      "Это 57.1% от генеральной совокупности (N=245)\n",
      "С такой выборкой средний возраст будет определён с точностью ±1 год(а) с вероятностью 95%\n"
     ]
    }
   ],
   "execution_count": 1
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-02T23:17:12.997437Z",
     "start_time": "2026-03-02T23:17:12.771343Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\"\"\"МЕТОД 2 - ВНУТРИГРУППОВАЯ ДИСПЕРСИЯ (Если есть только группировка по полу, национальности, ...)\n",
    "Расчет объема пилотной выборки преступлений определенного типа \"УБИЙСТВО\" \n",
    "\n",
    "? СКОЛЬКО НАМ НАДО ИЗУЧИТЬ ДЕЛ, чтобы с уверенностью n% утверждать групповой признак преступника\n",
    "\n",
    "Используется, когда мы знаем распределение генеральной совокупности по группам \n",
    "(например, пол: мужчины / женщины). \n",
    "Вместо дисперсии количественного признака берётся средняя внутригрупповая дисперсия, \n",
    "вычисленная через доли групп.\"\"\"\n",
    "\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "from scipy import stats\n",
    "\n",
    "def sample_size_by_groups(N_groups, alpha=0.05, delta=1):\n",
    "    \"\"\"\n",
    "    Рассчитывает объём выборки на основе распределения по группам.\n",
    "    \n",
    "    Parameters:\n",
    "    N_groups : list или array\n",
    "        Численности групп (например, [223, 24] для мужчин и женщин)\n",
    "    alpha : float\n",
    "        Уровень значимости (по умолчанию 0.05)\n",
    "    delta : float\n",
    "        Предельная ошибка в единицах совокупности (по умолчанию 1)\n",
    "    \n",
    "    Returns:\n",
    "    n : int\n",
    "        Рекомендуемый объём выборки\n",
    "    \"\"\"\n",
    "    N_groups = np.array(N_groups)\n",
    "    N_total = N_groups.sum()\n",
    "    p = N_groups / N_total            # доли групп\n",
    "    q = 1 - p\n",
    "    # средняя внутригрупповая дисперсия\n",
    "    sigma2_bar = np.sum(p * q * N_groups) / N_total\n",
    "    \n",
    "    # критерий Стьюдента (двусторонний)\n",
    "    t = stats.t.ppf(1 - alpha/2, df=N_total-1)\n",
    "    \n",
    "    # объём выборки\n",
    "    numerator = t**2 * sigma2_bar * N_total\n",
    "    denominator = delta**2 * N_total + t**2 * sigma2_bar\n",
    "    n = numerator / denominator\n",
    "    return int(np.ceil(n))\n",
    "\n",
    "# Пример из книги: мужчин 223, женщин 24, N=247, alpha=0.05, delta=1\n",
    "n_rec = sample_size_by_groups([223, 24], alpha=0.05, delta=1)\n",
    "print(f\"Рекомендуемый объём выборки: {n_rec}\")  # Должно быть около 704 (как в книге)\n",
    "\n"
   ],
   "id": "c8125460a683632e",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Рекомендуемый объём выборки: 1\n"
     ]
    }
   ],
   "execution_count": 2
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "(\"\"\n",
    " \n",
    " \"Продолжение МЕТОД 3\"\n",
    " \n",
    " \"\")"
   ],
   "id": "2f204d9b69694fe4"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
